//*****************************************************************************
// 基础练习1.2: 软件延时实现LED灯亮度控制
//
// 不同亮度的实现方法:
// 引脚P1.0交替输出高电平和低电平,通过输出高电平和低电平来控制LED的亮和灭。
// 亮/灭的速度如果很快,人眼就识别不出来.此时改变亮/灭的时间比,就可以改变亮度.
// 可以先按照50%张开空比,调整时间, 到看不出闪烁的效果; 然后再调整高低电平的占比;
//     +-----+      +------+
//     |     |      |      |
// ----+     +------+      +---------
// 可能出现的错误:
// (1)周期太长,人眼感觉到闪烁.先调整周期,感受不到闪烁时,再来改变占空比.
//
//
// -------------MSP-EXP432P401R硬件描述 -----------------
// (1) 顶部 1个复位按键,S3
// (2) 左右两侧各1个用户按键,S1(P1.1),S2(P1.4)
// (3) 1个单色发光管LED1(P1.0红)
// (4) 1个三色发光管LED2(P2.0红/P2.1绿/P2.2蓝)
//
//         MSP-EXP432P401R
//         +-------------+
//     /|\ |             |
//      |  |             |
//  S3  +--|RST          |
//         |         P1.0|---> LED1(红)
//  S1 --->|P1.1         |
//         |         P2.0|---> LED2(红)
//  S2 --->|P1.4     P2.1|---> LED2(绿)
//         |         P2.2|---> LED2(蓝)
//         |             |
// 按键引脚设置为输入,且使能内部上拉电阻.按键未按下时,读取引脚是高电平;按键按下时,接地,读取引脚是低电平;
// LED引脚设置为输出。输出高电平时，点亮LED; 输出低电平时，熄灭LED。
//
//-------------------------------------------------------
//
//
//*****************************************************************************

//常见标准头文件包含
#include <stdint.h>
#include <stdbool.h>

//外设驱动库DriverLib 头文件包含
//--如果编译此处出错,请查看工程的设置, 看下是否把SDK路径包含进来
//--Properties / Build / ARM Compiler / Include Options
#include <ti/devices/msp432p4xx/driverlib/driverlib.h>

void main(void)
{
    volatile uint32_t ui32_delay;

    //关闭看门狗。实验例程, 我们一般不需要看门狗, 直接关闭
    WDT_A_holdTimer();

    //引脚P1.0连接LED1
    //设置引脚P1.0为输出
    GPIO_setAsOutputPin(GPIO_PORT_P1, GPIO_PIN0);

    while(1)
    {
        //输出高电平,LED亮
        GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN0);
        //此处要加延时,延时越长,表示亮的时间越久,亮度高
        //例如,此处的延时分别为  30,300,3000, 下载代码,可以看到亮度有明显区别;
        for(ui32_delay=0;ui32_delay<300;ui32_delay++);

        //输出低电平,LED灭
        GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);
        for(ui32_delay=0;ui32_delay<3000;ui32_delay++);
    }

}
